package javaone.lesson_four;

public class main {





    public static void main(String[] args) {


        Wokers wokers  = new Wokers("Иванов Иван Иванович", "Специалист", "+7-495-221-01-02","80000", "25");
        wokers.nameWoker();
        wokers.namePosition();

    //массив из пати сотрудников
       // String[][] arrWoker = new String[5][5];
        String [][] arrWoker ={
                {"Алехин Алексей Влексеевич","специалист","+7-495-221-01-01", "80000", "30"},
                {"Борисов Борис Борисович","главный специалист","+7-495-221-01-02", "90000", "35"},
                {"Васильев Василий Васильевич","Зам начальника отдела","+7-495-221-01-03", "100000", "41"},
                {"Николаев Николай Николаевич","Начальник отдела","+7-495-221-01-03", "120000", "46"},
                {"Сергеев Сергей Сергеевич","Начальник Управления","+7-495-221-01-05", "150000", "50"}
        };

        Wokers.findAge (arrWoker);
        Wokers.growthSalary(arrWoker);





    }
}
